#include <iostream>
#include <string>

using namespace std;

int main() {
    int p1, p2, p3, p4;

    // Зчитуємо 4 числа
    cin >> p1 >> p2 >> p3 >> p4;

    // Перевірка умови: кожне число має бути у діапазоні від 1 до 255
    if ((p1 >= 1 && p1 <= 255) && 
        (p2 >= 1 && p2 <= 255) && 
        (p3 >= 1 && p3 <= 255) && 
        (p4 >= 1 && p4 <= 255)) {
        
        // Формуємо та виводимо IP-адресу через крапки
        cout << p1 << "." << p2 << "." << p3 << "." << p4 << endl;
    }

    return 0;
}